# Checkpoint Three: Cleaning Data

Now you are ready to clean your data. Before starting coding, provide the link to your dataset below.

My dataset: https://www.kaggle.com/datasets/justinas/startup-investments

Import the necessary libraries and create your dataframe(s).

In [58]:
# importing pandas library
import pandas as pd
import numpy as np

# creating dataframes
acquisitions_df = pd.read_csv('acquisitions.csv')
degrees_df = pd.read_csv('degrees.csv')
funding_rounds_df = pd.read_csv('funding_rounds.csv')
funds_df = pd.read_csv('funds.csv')
investments_df = pd.read_csv('investments.csv')
ipos_df = pd.read_csv('ipos.csv')
milestones_df = pd.read_csv('milestones.csv')
objects_df = pd.read_csv('objects.csv')
offices_df = pd.read_csv('offices.csv')
people_df = pd.read_csv('people.csv')
relationships_df = pd.read_csv('relationships.csv')

/var/folders/zf/cb3_1h9969d8z3n17n7d956r0000gn/T/ipykernel_94200/670547435.py:13: DtypeWarning: Columns (3,7,9,10,17,18,21,22,23,25,26,29,30,37) have mixed types. Specify dtype option on import or set low_memory=False.
  objects_df = pd.read_csv('objects.csv')

## Missing Data

Test your dataset for missing data and handle it as needed. Make notes in the form of code comments as to your thought process.

In [59]:
# Finding missing data in table #1: acquisitions_df
# print(acquisitions_df.isna().sum())
# print(acquisitions_df.shape)

# It appears that the column 'term_code' has by far and away the most cells with
# no data, at 7658 out of 9562 total rows in the dataframe (80.01% empty).

# print(acquisitions_df['term_code'].unique())

# The values that show up in 'term_code' (cash, stock, cash_and_stock) still seem
# relevant, though, so I think I'll leave that column in the dataframe. 

# The other columns with significant missing data ('source_url' and 'source_description')
# are columns that I'm already considering dropping as irrelevant to the analysis. 

acquisitions_df.columns

acquisitions_df.drop(columns=['source_url', 'source_description'], inplace=True)
acquisitions_df.head()

# I think I also don't care when something was 'created_at' and 'updated_at' for purposes
# of this analysis

acquisitions_df.drop(columns=['created_at', 'updated_at'], inplace=True)
acquisitions_df.head()

# That's a much nicer-looking dataframe!

,id,acquisition_id,acquiring_object_id,acquired_object_id,term_code,price_amount,price_currency_code,acquired_at
0,1,1,c:11,c:10,NaN,20000000.0,USD,2007-05-30
1,2,7,c:59,c:72,cash,60000000.0,USD,2007-07-01
2,3,8,c:24,c:132,cash,280000000.0,USD,2007-05-01
3,4,9,c:59,c:155,cash,100000000.0,USD,2007-06-01
4,5,10,c:212,c:215,cash,25000000.0,USD,2007-07-01

In [60]:
# Finding missing data in table #2: degrees_df

# print(degrees_df.isna().sum())
# print(degrees_df.shape)

# The 'graduated_at' column is missing data in 47.04% of its rows.  I'm debating whether
# there's any value in knowing when someone graduated in this analysis.  It could help
# determine the age of entepreneurs who are successful in getting their startups funded,
# so perhaps it's still worth keeping in. 

# The 'subject' and 'degree_type' columns are missing data in 25.83% and 10.24% of their rows,
# respectively.  They both still seem like relevant factors to the analysis, though. 

degrees_df.columns

degrees_df.drop(columns=['created_at', 'updated_at'], inplace=True)
degrees_df.head()

,id,object_id,degree_type,subject,institution,graduated_at
0,1,p:6117,MBA,NaN,NaN,NaN
1,2,p:6136,BA,"English, French","Washington University, St. Louis",1990-01-01
2,3,p:6136,MS,Mass Communication,Boston University,1992-01-01
3,4,p:6005,MS,Internet Technology,University of Greenwich,2006-01-01
4,5,p:5832,BCS,"Computer Science, Psychology",Rice University,NaN

In [61]:
# Finding missing data in table #3: funding_rounds_df
# print(funding_rounds_df.isna().sum())
# print(funding_rounds_df.shape)

# print(funding_rounds_df['pre_money_currency_code'].unique())
# print(funding_rounds_df['post_money_currency_code'].unique())

# I'm debating whether anything pertaining to pre_money or post_money needs to stay in the
# dataframe.  I don't think companies' valuations are going to be part of this analysis -
# rather just whether they did or didn't get funding, and to some extend how much.  Other
# columns with empty rows ('source_url', 'source_description', 'created_by') can also go. 

funding_rounds_df.columns.tolist()

funding_rounds_df.drop([
    'raised_amount',
    'raised_currency_code',
    'pre_money_valuation',
    'pre_money_currency_code',
    'post_money_valuation',
    'post_money_currency_code',
    'source_url',
    'source_description',
    'created_by', 
    'created_at',
    'updated_at'
], axis=1, inplace=True)

funding_rounds_df.head()

,id,funding_round_id,object_id,funded_at,funding_round_type,funding_round_code,raised_amount_usd,pre_money_valuation_usd,post_money_valuation_usd,participants,is_first_round,is_last_round
0,1,1,c:4,2006-12-01,series-b,b,8500000.0,0.0,0.0,2,0,0
1,2,2,c:5,2004-09-01,angel,angel,500000.0,0.0,0.0,2,0,1
2,3,3,c:5,2005-05-01,series-a,a,12700000.0,115000000.0,0.0,3,0,0
3,4,4,c:5,2006-04-01,series-b,b,27500000.0,525000000.0,0.0,4,0,0
4,5,5,c:7299,2006-05-01,series-b,b,10500000.0,0.0,0.0,2,0,0

In [65]:
# Finding missing data in table #3: funds_df

print(funds_df.isna().sum())
print(funds_df.shape)

# Not much data missing from this dataframe, and most of what's missing is in columns
# that I don't care about anyway. 

funds_df.drop(['source_url', 'source_description', 'created_at', 'updated_at'], axis=1, inplace=True)
funds_df.head()

id                        0
fund_id                   0
object_id                 0
name                      0
funded_at               115
raised_amount             0
raised_currency_code      0
source_url              292
source_description      346
created_at                0
updated_at                0
dtype: int64
(1564, 11)

,id,fund_id,object_id,name,funded_at,raised_amount,raised_currency_code
0,1,1,f:371,Second Fund,2008-12-16,300000000.0,USD
1,4,4,f:17,Sequoia Israel Fourth Fund,2008-12-17,200750000.0,USD
2,5,5,f:951,Tenth fund,2008-08-11,650000000.0,USD
3,6,6,f:192,New funds acquire,NaN,625000000.0,USD
4,7,7,f:519,Third fund,2008-05-20,200000000.0,USD

In [67]:
# Finding missing data in table #5: investments_df

print(investments_df.isna().sum())
print(investments_df.shape)

# Whoa!  No missing data? 

investments_df.drop(columns=['created_at', 'updated_at'], axis=1, inplace=True)
investments_df.head()

id                    0
funding_round_id      0
funded_object_id      0
investor_object_id    0
created_at            0
updated_at            0
dtype: int64
(80902, 6)

   id  funding_round_id funded_object_id investor_object_id
0   1                 1              c:4                f:1
1   2                 1              c:4                f:2
2   3                 3              c:5                f:4
3   4                 4              c:5                f:1
4   5                 4              c:5                f:5

In [71]:
# Finding missing data in table #6: ipos_df

print(ipos_df.isna().sum())
print(ipos_df.shape)

# Checking values in some of the columns that are missing data

print(ipos_df['valuation_currency_code'].unique().tolist())
print(ipos_df['raised_currency_code'].unique().tolist())

# Seems like those columns are still relevant, even with missing data

ipos_df.drop(columns=['source_url', 'source_description', 'created_at', 'updated_at'], axis=1, inplace=True)
ipos_df.head()

id                            0
ipo_id                        0
object_id                     5
valuation_amount              0
valuation_currency_code       2
raised_amount                 0
raised_currency_code        560
public_at                   600
stock_symbol                  0
source_url                 1068
source_description         1079
created_at                    0
updated_at                    0
dtype: int64
(1259, 13)
['USD', 'JPY', nan, 'CAD', 'EUR', 'GBP']
['USD', nan, 'EUR', 'JPY', 'GBP', 'CAD']

,id,ipo_id,object_id,valuation_amount,valuation_currency_code,raised_amount,raised_currency_code,public_at,stock_symbol
0,1,1,c:1654,0.000000e+00,USD,0.0,USD,1980-12-19,NASDAQ:AAPL
1,2,2,c:1242,0.000000e+00,USD,0.0,NaN,1986-03-13,NASDAQ:MSFT
2,3,3,c:342,0.000000e+00,USD,0.0,NaN,1969-06-09,NYSE:DIS
3,4,4,c:59,0.000000e+00,USD,0.0,NaN,2004-08-25,NASDAQ:GOOG
4,5,5,c:317,1.000000e+11,USD,0.0,NaN,1997-05-01,NASDAQ:AMZN

In [74]:
# Finding missing data in table #7: milestones_df

print(milestones_df.isna().sum())
print(milestones_df.shape)

# All data is here, except in columns I already don't care about

print(milestones_df['milestone_code'].unique())

# Looks like the 'milestone_code' column also only has 'other' in it as a value,
# which isn't particularly helpful, so I'm going to drop that column, as well. 

milestones_df.drop([
    'milestone_code',
    'source_url',
    'source_description',
    'created_at',
    'updated_at'
], axis=1, inplace=True)

milestones_df.head()

id                        0
object_id                 0
milestone_at              0
milestone_code            0
description               0
source_url             8055
source_description    10188
created_at                0
updated_at                0
dtype: int64
(39456, 9)
['other']

,id,object_id,milestone_at,description
0,1,c:12,2008-06-09,Survives iPhone 3G Stevenote
1,2,c:3138,2008-06-17,Twhirl announces support for Seesmic video pla...
2,3,c:59,2008-06-18,More than 4 Billion videos viewed at Google Si...
3,4,c:314,2008-06-18,Reddit goes Open Source
4,5,c:314,2008-01-22,Adds the ability to create your own Reddits

In [77]:
# Finding missing data in table #8: objects_df

print(objects_df.isna().sum())
print(objects_df.shape)

# This table has a TON of missing data, which is great, because the file is HUGE
# and I need to trim it down a lot to get it to work in Tableau.  So, let's get at
# it...

# 'parent_id' is 94.01% empty.  Gone.
# 'category_code' is 73.37% empty, but it's a column that might be relevant in my analysis,
# so I'm going to leave it for the moment.
# 'founded_at' is 78.29% empty, but it seems like it could he relevant to see how much time
# exists between an entity getting founded and it getting established, so I'm going to leave
# it for the moment.
# 'closed_at', however, I don't think will be relevant, so I'm going to drop it

print(objects_df.columns.tolist())

objects_df.drop([
    'parent_id', 
    'permalink',
    'closed_at',
    'domain', 
    'homepage_url', 
    'twitter_username', 
    'logo_url', 
    'logo_width', 
    'logo_height', 
    'short_description', 
    'description', 
    'overview',
    'created_by', 
    'created_at', 
    'updated_at'
], axis=1, inplace=True)

objects_df.head()

id                          0
entity_type                 0
entity_id                   0
parent_id              434936
name                        4
normalized_name            31
permalink                   0
category_code          339465
status                      0
founded_at             362210
closed_at              459842
domain                 287709
homepage_url           287709
twitter_username       336562
logo_url               253801
logo_width                  0
logo_height                 0
short_description      455034
description            367646
overview               227416
tag_list               356155
country_code           367608
state_code             407891
city                   371967
region                      0
first_investment_at    445695
last_investment_at     445695
investment_rounds           0
invested_companies          0
first_funding_at       431144
last_funding_at        431144
funding_rounds              0
funding_total_usd           0
first_milestone_at     362293
last_milestone_at      362293
milestones                  0
relationships               0
created_by             123165
created_at                 60
updated_at                  0
dtype: int64
(462651, 40)
['id', 'entity_type', 'entity_id', 'parent_id', 'name', 'normalized_name', 'permalink', 'category_code', 'status', 'founded_at', 'closed_at', 'domain', 'homepage_url', 'twitter_username', 'logo_url', 'logo_width', 'logo_height', 'short_description', 'description', 'overview', 'tag_list', 'country_code', 'state_code', 'city', 'region', 'first_investment_at', 'last_investment_at', 'investment_rounds', 'invested_companies', 'first_funding_at', 'last_funding_at', 'funding_rounds', 'funding_total_usd', 'first_milestone_at', 'last_milestone_at', 'milestones', 'relationships', 'created_by', 'created_at', 'updated_at']

,id,entity_type,entity_id,name,normalized_name,category_code,status,founded_at,tag_list,country_code,...,investment_rounds,invested_companies,first_funding_at,last_funding_at,funding_rounds,funding_total_usd,first_milestone_at,last_milestone_at,milestones,relationships
0,c:1,Company,1,Wetpaint,wetpaint,web,operating,2005-10-17,"wiki, seattle, elowitz, media-industry, media-...",USA,...,0,0,2005-10-01,2008-05-19,3,39750000.0,2010-09-05,2013-09-18,5,17
1,c:10,Company,10,Flektor,flektor,games_video,acquired,NaN,"flektor, photo, video",USA,...,0,0,NaN,NaN,0,0.0,NaN,NaN,0,6
2,c:100,Company,100,There,there,games_video,acquired,NaN,"virtualworld, there, teens",USA,...,0,0,NaN,NaN,0,0.0,2003-02-01,2011-09-23,4,12
3,c:10000,Company,10000,MYWEBBO,mywebbo,network_hosting,operating,2008-07-26,"social-network, new, website, web, friends, ch...",NaN,...,0,0,NaN,NaN,0,0.0,NaN,NaN,0,0
4,c:10001,Company,10001,THE Movie Streamer,the movie streamer,games_video,operating,2008-07-26,"watch, full-length, moives, online, for, free,...",NaN,...,0,0,NaN,NaN,0,0.0,NaN,NaN,0,0

In [86]:
# Finding missing data in table #9: offices_df

print(offices_df.isna().sum())
print(offices_df.shape)

# print(offices_df['description'].unique())
# this column seems unnecessary

# specific addresses seem unnecessary

# offices_df.drop(columns=[
#     'description',
#     'address1',
#     'address2', 
#     'created_at',
#     'updated_at'
# ], axis=1, inplace=True)

# offices_df.head()

# Seems like 'region' and 'city' are much more complete sources of data than 'zip_code', 
# 'state_code', so I guess I'll drop those two, as well.

# offices_df.drop(columns=['zip_code', 'state_code'], axis=1, inplace=True)
offices_df.head()

id                 0
object_id          0
office_id          0
region             0
city            5168
country_code       0
latitude           0
longitude          0
dtype: int64
(112718, 8)

,id,object_id,office_id,region,city,country_code,latitude,longitude
0,1,c:1,1,Seattle,Seattle,USA,47.603122,-122.333253
1,2,c:3,3,SF Bay,Pleasanton,USA,37.692934,-121.904945
2,3,c:4,4,SF Bay,San Francisco,USA,37.764726,-122.394523
3,4,c:5,5,SF Bay,Menlo Park,USA,37.416050,-122.151801
4,5,c:7,7,SF Bay,Palo Alto,ISR,0.000000,0.000000

In [88]:
# Finding missing data in table #10: people_df

print(people_df.isna().sum())
print(people_df.shape)

# With birthplaces, which was kind of the only potentially useful column in this table,
# being 87.61% empty, this whole dtable seems rather useless.  I'll hold onto it for now,
# just in case.

people_df.drop(columns=['birthplace'], axis=1, inplace=True)
people_df.head()

id                       0
object_id                0
first_name               9
last_name                4
birthplace          198625
affiliation_name        25
dtype: int64
(226709, 6)

   id object_id first_name last_name affiliation_name
0   1       p:2        Ben   Elowitz        Blue Nile
1   2       p:3      Kevin  Flaherty         Wetpaint
2   3       p:4       Raju   Vegesna             Zoho
3   4       p:5        Ian     Wenig             Zoho
4   5       p:6      Kevin      Rose     i/o Ventures

In [91]:
# Finding missing data in table #11: relationships_df

print(relationships_df.isna().sum())
print(relationships_df.shape)

# Are 'is_past' and 'sequence' in any way relevant?  I don't think so... 

# relationships_df.drop([
#     'start_at',
#     'end_at',
#     'is_past',
#     'sequence',
#     'created_at',
#     'updated_at'
# ], axis=1, inplace=True)

relationships_df.head()

# This whole table is starting to feel rather unnecessary, as well.

id                            0
relationship_id               0
person_object_id              0
relationship_object_id        0
title                     13352
dtype: int64
(402878, 5)

,id,relationship_id,person_object_id,relationship_object_id,title
0,1,1,p:2,c:1,Co-Founder/CEO/Board of Directors
1,2,2,p:3,c:1,VP Marketing
2,3,3,p:4,c:3,Evangelist
3,4,4,p:5,c:3,Senior Director Strategic Alliances
4,6,6,p:7,c:4,Chief Executive Officer

## Irregular Data

Detect outliers in your dataset and handle them as needed. Use code comments to make notes about your thought process.

## Unnecessary Data

Look for the different types of unnecessary data in your dataset and address it as needed. Make sure to use code comments to illustrate your thought process.

## Inconsistent Data

Check for inconsistent data and address any that arises. As always, use code comments to illustrate your thought process.

## Summarize Your Results

Make note of your answers to the following questions.

1. Did you find all four types of dirty data in your dataset?
2. Did the process of cleaning your data give you new insights into your dataset?
3. Is there anything you would like to make note of when it comes to manipulating the data and making visualizations?